Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

Aquire

In [1]:
import wrangle
from env import host, user, password
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import acquire
url = f'mysql+pymysql://{user}:{password}@{host}iris_db'
from pydataset import data
import acquire
import env
import warnings
warnings.filterwarnings('ignore')
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import MinMaxScaler
from env import host, user, password
import sys
from sklearn.impute import SimpleImputer

In [2]:
df_iris= data('iris')

print the first 3 rows
print the number of rows and columns (shape)
print the column names
print the data type of each column
print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [3]:
df_iris= df_iris.head(3)

In [4]:
df_iris.shape

(3, 5)

In [5]:
print(df_iris.columns)

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [6]:
print(df_iris.dtypes)

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [7]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length   Petal.Width
count           3.0     3.000000      3.000000  3.000000e+00
mean            4.9     3.233333      1.366667  2.000000e-01
std             0.2     0.251661      0.057735  3.399350e-17
min             4.7     3.000000      1.300000  2.000000e-01
25%             4.8     3.100000      1.350000  2.000000e-01
50%             4.9     3.200000      1.400000  2.000000e-01
75%             5.0     3.350000      1.400000  2.000000e-01
max             5.1     3.500000      1.400000  2.000000e-01

2. Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [8]:
df_excel=pd.read_excel('Matt Santos - Excel_Exercises.xlsx')

In [9]:
print(df_excel.columns[0:5])

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [10]:
print(list(df_excel.dtypes[df_excel.dtypes=='object'].index))

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn', 'Contract Type', 'Phone Service', 'Internet service', 'Length of tenure']

In [11]:
num_cols=list(df_excel.dtypes[df_excel.dtypes!='object'].index)

In [12]:
print(df_excel[num_cols].max()-df_excel[num_cols].min())

is_senior_citizen                        1
phone_service                            2
internet_service                         2
contract_type                            2
monthly_charges                      92.45
total_charges                       4396.4
Tenure (months)                          0
is_female                                1
has_churned                              1
has_phone                                1
has_internet                             1
partners_dependants                      3
Start Date                 0 days 00:00:00
Average monthly charges            91.5917
dtype: object

In [13]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
df_google.shape

(891, 12)

In [16]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
for col in df_google:
    if df_google[col].dtype=='O':
       print(df_google[col].value_counts()[0:5])

Silverthorne, Mr. Spencer Victor    1
Blank, Mr. Henry                    1
Chapman, Mr. John Henry             1
Stewart, Mr. Albert A               1
Collander, Mr. Erik Gustaf          1
Name: Name, dtype: int64
male      577
female    314
Name: Sex, dtype: int64
347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
Name: Ticket, dtype: int64
B96 B98        4
G6             4
C23 C25 C27    4
F33            3
C22 C26        3
Name: Cabin, dtype: int64
S    644
C    168
Q     77
Name: Embarked, dtype: int64